[{"title": "Trade setup for Monday: 15 things to know before opening bell", "href": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-15-things-to-know-before-opening-bell-18-12392891.html", "body": "A short build-up was seen in 27 stocks, including Info Edge India, Can Fin Homes, MRF, HDFC Asset Management Company and Zydus Lifesciences. An increase in OI along with a fall in price points to ..."}, {"title": "LIC Housing Finance plans to raise funds via green bonds in next ...", "href": "https://economictimes.indiatimes.com/markets/bonds/lic-housing-finance-plans-to-raise-funds-via-green-bonds-in-next-financial-year/articleshow/108178958.cms", "body": "Adhikari said the company hopes to hit the net profit of Rs 5,000 crore-milestone by the end of current financial year on the back of robust loan demand and expansion in non-core business. The non-core businesses include Loan Against Property (LAP) and affordable housing finance, he said. \"Affordable housing segment remained strong in tier-2 and tier-3 markets."}, {"title": "Ahead of Market: 10 things that will decide stock action on Monday", "href": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-monday/articleshow/108181128.cms", "body": "Tech View: Bullish Marubozu candle \"Nifty closed above the crucial resistance zone of 22,250-300 levels on weekly closing basis and we believe that as long as Nifty is holding above 22,000 mark, the rally is likely to continue and it can test the next resistance zone of 22,450-500 on an immediate basis and eventually Nifty can test level of 22,700 on the higher side,\" said Tejas Shah ..."}, {"title": "'Shark Tank India' judge Namita Thapar teases project with MS Dhoni ...", "href": "https://economictimes.indiatimes.com/magazines/panache/shark-tank-india-judge-namita-thapar-teases-project-with-ms-dhoni-shares-pics/articleshow/108180108.cms", "body": "Namita Thapar, renowned business figure and 'Shark Tank India' judge, recently hinted at an upcoming collaboration with cricket icon MS Dhoni, sparking excitement among fans. The duo's stylish photos together have left followers eagerly anticipating further details about their joint venture. As Thapar continues to mentor entrepreneurs on the show, this unexpected partnership with Dhoni ..."}, {"title": "Cooperating With IAEA Shows Advancement Of Nuclear Medicine In Kuwait ...", "href": "https://menafn.com/1107927868/Cooperating-With-IAEA-Shows-Advancement-Of-Nuclear-Medicine-In-Kuwait-Official", "body": "World and Middle East business and financial news, Stocks, Currencies, Market Data, Research, Weather and other data. Contact Us Click here Tel: +962 6 5690450"}]